src/main/java/ok/dht/test/saskov/stress_testing/stage2/wrk_get.txt
-- Нагрузочное тестирование get запросами. Stage 2.
-- Было проведено 5 тестов, все тесты проводиись с rate-ом 150:
-- 1) В 1 поток и 1 соединение
-- 2) В 4 потока и 4 соединения 
-- 3) В 8 потоков и 8 соединений (на этом тесте произошло что-то странное, рассмотрел в отчете с помощью профилирования)
-- 4) В 16 потоков и 16 соединений 
-- 5) В 8 потоков и 8 соединений (решил повторить тест в 8 потоков, потому что 3й дал очень большую задержку)

lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 1 -d 60s -t 1 -R 150 -L -s get_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  1 threads and 1 connections
  Thread calibration: mean lat.: 24.611ms, rate sampling interval: 219ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.02ms    2.21ms  44.29ms   95.64%
    Req/Sec   149.86      2.98   174.00     93.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.62ms
 75.000%    6.24ms
 90.000%    7.61ms
 99.000%    9.65ms
 99.900%   40.48ms
 99.990%   44.26ms
 99.999%   44.32ms
100.000%   44.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.709     0.000000            1         1.00
       4.831     0.100000          758         1.11
       5.087     0.200000         1502         1.25
       5.271     0.300000         2250         1.43
       5.447     0.400000         3009         1.67
       5.623     0.500000         3764         2.00
       5.715     0.550000         4137         2.22
       5.811     0.600000         4514         2.50
       5.927     0.650000         4884         2.86
       6.059     0.700000         5253         3.33
       6.235     0.750000         5626         4.00
       6.363     0.775000         5817         4.44
       6.539     0.800000         6000         5.00
       6.767     0.825000         6190         5.71
       7.063     0.850000         6375         6.67
       7.331     0.875000         6564         8.00
       7.479     0.887500         6660         8.89
       7.607     0.900000         6751        10.00
       7.723     0.912500         6844        11.43
       7.871     0.925000         6940        13.33
       7.991     0.937500         7035        16.00
       8.067     0.943750         7079        17.78
       8.135     0.950000         7125        20.00
       8.215     0.956250         7172        22.86
       8.295     0.962500         7219        26.67
       8.391     0.968750         7266        32.00
       8.439     0.971875         7295        35.56
       8.479     0.975000         7314        40.00
       8.519     0.978125         7338        45.71
       8.607     0.981250         7363        53.33
       8.711     0.984375         7385        64.00
       8.759     0.985938         7395        71.11
       8.911     0.987500         7407        80.00
       9.423     0.989062         7418        91.43
      10.199     0.990625         7430       106.67
      13.103     0.992188         7442       128.00
      14.375     0.992969         7448       142.22
      15.719     0.993750         7454       160.00
      17.967     0.994531         7459       182.86
      20.191     0.995313         7465       213.33
      22.527     0.996094         7471       256.00
      22.927     0.996484         7474       284.44
      25.039     0.996875         7477       320.00
      28.079     0.997266         7480       365.71
      31.423     0.997656         7483       426.67
      36.095     0.998047         7486       512.00
      37.503     0.998242         7487       568.89
      38.367     0.998437         7489       640.00
      38.943     0.998633         7490       731.43
      40.159     0.998828         7492       853.33
      40.479     0.999023         7493      1024.00
      41.375     0.999121         7494      1137.78
      42.175     0.999219         7495      1280.00
      42.175     0.999316         7495      1462.86
      42.239     0.999414         7496      1706.67
      43.743     0.999512         7497      2048.00
      43.743     0.999561         7497      2275.56
      43.775     0.999609         7498      2560.00
      43.775     0.999658         7498      2925.71
      43.775     0.999707         7498      3413.33
      44.255     0.999756         7499      4096.00
      44.255     0.999780         7499      4551.11
      44.255     0.999805         7499      5120.00
      44.255     0.999829         7499      5851.43
      44.255     0.999854         7499      6826.67
      44.319     0.999878         7500      8192.00
      44.319     1.000000         7500          inf
#[Mean    =        6.016, StdDeviation   =        2.206]
#[Max     =       44.288, Total count    =         7500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9001 requests in 1.00m, 579.06KB read
Requests/sec:    150.00
Transfer/sec:      9.65KB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 4 -d 60s -t 4 -R 150 -L -s get_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  4 threads and 4 connections
  Thread calibration: mean lat.: 7.970ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.587ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.037ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 8.219ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.78ms  764.18us  12.25ms   71.36%
    Req/Sec    38.12     29.23    66.00     63.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.64ms
 75.000%    7.17ms
 90.000%    7.91ms
 99.000%    9.01ms
 99.900%    9.71ms
 99.990%   11.99ms
 99.999%   12.26ms
100.000%   12.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.063     0.000000            1         1.00
       5.943     0.100000          757         1.11
       6.163     0.200000         1516         1.25
       6.331     0.300000         2262         1.43
       6.483     0.400000         3006         1.67
       6.639     0.500000         3754         2.00
       6.723     0.550000         4140         2.22
       6.815     0.600000         4504         2.50
       6.915     0.650000         4876         2.86
       7.023     0.700000         5256         3.33
       7.167     0.750000         5628         4.00
       7.251     0.775000         5822         4.44
       7.347     0.800000         6005         5.00
       7.451     0.825000         6192         5.71
       7.579     0.850000         6383         6.67
       7.739     0.875000         6563         8.00
       7.823     0.887500         6660         8.89
       7.907     0.900000         6756        10.00
       7.975     0.912500         6844        11.43
       8.067     0.925000         6938        13.33
       8.179     0.937500         7032        16.00
       8.247     0.943750         7087        17.78
       8.303     0.950000         7125        20.00
       8.359     0.956250         7176        22.86
       8.423     0.962500         7223        26.67
       8.511     0.968750         7270        32.00
       8.567     0.971875         7292        35.56
       8.599     0.975000         7314        40.00
       8.655     0.978125         7337        45.71
       8.727     0.981250         7361        53.33
       8.815     0.984375         7384        64.00
       8.855     0.985938         7398        71.11
       8.895     0.987500         7410        80.00
       8.967     0.989062         7419        91.43
       9.039     0.990625         7430       106.67
       9.095     0.992188         7442       128.00
       9.151     0.992969         7449       142.22
       9.175     0.993750         7454       160.00
       9.215     0.994531         7459       182.86
       9.263     0.995313         7465       213.33
       9.319     0.996094         7472       256.00
       9.351     0.996484         7474       284.44
       9.439     0.996875         7477       320.00
       9.471     0.997266         7481       365.71
       9.487     0.997656         7483       426.67
       9.551     0.998047         7486       512.00
       9.575     0.998242         7487       568.89
       9.591     0.998437         7489       640.00
       9.639     0.998633         7490       731.43
       9.711     0.998828         7494       853.33
       9.711     0.999023         7494      1024.00
       9.711     0.999121         7494      1137.78
       9.887     0.999219         7495      1280.00
       9.887     0.999316         7495      1462.86
       9.951     0.999414         7496      1706.67
      11.751     0.999512         7497      2048.00
      11.751     0.999561         7497      2275.56
      11.839     0.999609         7498      2560.00
      11.839     0.999658         7498      2925.71
      11.839     0.999707         7498      3413.33
      11.991     0.999756         7499      4096.00
      11.991     0.999780         7499      4551.11
      11.991     0.999805         7499      5120.00
      11.991     0.999829         7499      5851.43
      11.991     0.999854         7499      6826.67
      12.255     0.999878         7500      8192.00
      12.255     1.000000         7500          inf
#[Mean    =        6.784, StdDeviation   =        0.764]
#[Max     =       12.248, Total count    =         7500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9004 requests in 1.00m, 576.00KB read
Requests/sec:    150.05
Transfer/sec:      9.60KB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 8 -d 60s -t 8 -R 150 -L -s get_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  8 threads and 8 connections
  Thread calibration: mean lat.: 7.727ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 7.000ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 7.828ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.081ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.789ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 7.154ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.354ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.568ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.58ms   49.54ms 676.86ms   98.61%
    Req/Sec    19.40     28.75   214.00     67.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.15ms
 75.000%    7.83ms
 90.000%    8.46ms
 99.000%  249.34ms
 99.900%  675.84ms
 99.990%  677.38ms
 99.999%  677.38ms
100.000%  677.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.055     0.000000            1         1.00
       6.123     0.100000          758         1.11
       6.443     0.200000         1504         1.25
       6.695     0.300000         2251         1.43
       6.923     0.400000         3002         1.67
       7.147     0.500000         3756         2.00
       7.271     0.550000         4136         2.22
       7.391     0.600000         4506         2.50
       7.527     0.650000         4873         2.86
       7.671     0.700000         5254         3.33
       7.827     0.750000         5627         4.00
       7.911     0.775000         5819         4.44
       8.007     0.800000         6000         5.00
       8.103     0.825000         6193         5.71
       8.215     0.850000         6375         6.67
       8.335     0.875000         6571         8.00
       8.399     0.887500         6659         8.89
       8.463     0.900000         6749        10.00
       8.543     0.912500         6842        11.43
       8.639     0.925000         6947        13.33
       8.735     0.937500         7029        16.00
       8.791     0.943750         7075        17.78
       8.879     0.950000         7124        20.00
       8.951     0.956250         7172        22.86
       9.047     0.962500         7216        26.67
       9.183     0.968750         7263        32.00
       9.263     0.971875         7288        35.56
       9.367     0.975000         7310        40.00
       9.495     0.978125         7334        45.71
       9.695     0.981250         7356        53.33
      10.399     0.984375         7379        64.00
      59.103     0.985938         7391        71.11
     154.239     0.987500         7403        80.00
     202.367     0.989062         7415        91.43
     295.167     0.990625         7427       106.67
     343.039     0.992188         7439       128.00
     390.399     0.992969         7444       142.22
     437.759     0.993750         7451       160.00
     438.783     0.994531         7456       182.86
     485.375     0.995313         7461       213.33
     532.479     0.996094         7468       256.00
     532.991     0.996484         7471       284.44
     580.607     0.996875         7475       320.00
     581.119     0.997266         7477       365.71
     581.631     0.997656         7480       426.67
     628.223     0.998047         7484       512.00
     628.223     0.998242         7484       568.89
     628.735     0.998437         7486       640.00
     628.735     0.998633         7486       731.43
     629.247     0.998828         7488       853.33
     675.839     0.999023         7489      1024.00
     676.351     0.999121         7491      1137.78
     676.351     0.999219         7491      1280.00
     676.351     0.999316         7491      1462.86
     676.863     0.999414         7494      1706.67
     676.863     0.999512         7494      2048.00
     676.863     0.999561         7494      2275.56
     676.863     0.999609         7494      2560.00
     676.863     0.999658         7494      2925.71
     676.863     0.999707         7494      3413.33
     677.375     0.999756         7496      4096.00
     677.375     1.000000         7496          inf
#[Mean    =       12.582, StdDeviation   =       49.538]
#[Max     =      676.864, Total count    =         7496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9008 requests in 1.00m, 571.92KB read
Requests/sec:    150.12
Transfer/sec:      9.53KB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 16 -d 60s -t 16 -R 150 -L -s get_script.lua http://localhost:12345
Running 1m test @ http://localhost:12345
  16 threads and 16 connections
  Thread calibration: mean lat.: 9.400ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 9.028ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.645ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 8.879ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 9.163ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 9.274ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.351ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.607ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.214ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.368ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 8.716ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.780ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.468ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 8.083ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.935ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.449ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.42ms    1.02ms  11.41ms   66.92%
    Req/Sec     9.58     20.52    66.00     81.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.44ms
 75.000%    9.15ms
 90.000%    9.74ms
 99.000%   10.67ms
 99.900%   11.17ms
 99.990%   11.40ms
 99.999%   11.41ms
100.000%   11.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.635     0.000000            1         1.00
       7.091     0.100000          756         1.11
       7.535     0.200000         1503         1.25
       7.863     0.300000         2265         1.43
       8.155     0.400000         3005         1.67
       8.439     0.500000         3767         2.00
       8.575     0.550000         4144         2.22
       8.711     0.600000         4506         2.50
       8.847     0.650000         4880         2.86
       8.999     0.700000         5255         3.33
       9.151     0.750000         5649         4.00
       9.223     0.775000         5822         4.44
       9.311     0.800000         6010         5.00
       9.399     0.825000         6199         5.71
       9.503     0.850000         6389         6.67
       9.615     0.875000         6567         8.00
       9.679     0.887500         6660         8.89
       9.743     0.900000         6758        10.00
       9.807     0.912500         6851        11.43
       9.903     0.925000         6951        13.33
       9.991     0.937500         7037        16.00
      10.039     0.943750         7082        17.78
      10.095     0.950000         7129        20.00
      10.167     0.956250         7181        22.86
      10.231     0.962500         7225        26.67
      10.295     0.968750         7272        32.00
      10.335     0.971875         7293        35.56
      10.391     0.975000         7321        40.00
      10.423     0.978125         7340        45.71
      10.471     0.981250         7368        53.33
      10.527     0.984375         7390        64.00
      10.551     0.985938         7401        71.11
      10.591     0.987500         7414        80.00
      10.623     0.989062         7424        91.43
      10.687     0.990625         7434       106.67
      10.727     0.992188         7446       128.00
      10.759     0.992969         7452       142.22
      10.791     0.993750         7458       160.00
      10.823     0.994531         7463       182.86
      10.855     0.995313         7470       213.33
      10.887     0.996094         7475       256.00
      10.911     0.996484         7478       284.44
      10.943     0.996875         7481       320.00
      10.975     0.997266         7484       365.71
      11.047     0.997656         7489       426.67
      11.055     0.998047         7490       512.00
      11.071     0.998242         7491       568.89
      11.095     0.998437         7493       640.00
      11.103     0.998633         7495       731.43
      11.167     0.998828         7496       853.33
      11.215     0.999023         7498      1024.00
      11.215     0.999121         7498      1137.78
      11.231     0.999219         7499      1280.00
      11.231     0.999316         7499      1462.86
      11.263     0.999414         7501      1706.67
      11.263     0.999512         7501      2048.00
      11.263     0.999561         7501      2275.56
      11.335     0.999609         7502      2560.00
      11.335     0.999658         7502      2925.71
      11.335     0.999707         7502      3413.33
      11.399     0.999756         7503      4096.00
      11.399     0.999780         7503      4551.11
      11.399     0.999805         7503      5120.00
      11.399     0.999829         7503      5851.43
      11.399     0.999854         7503      6826.67
      11.415     0.999878         7504      8192.00
      11.415     1.000000         7504          inf
#[Mean    =        8.423, StdDeviation   =        1.020]
#[Max     =       11.408, Total count    =         7504]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9008 requests in 1.00m, 570.08KB read
Requests/sec:    150.07
Transfer/sec:      9.50KB


lev.saskov@lev-saskov-personal-mac wrk_scripts % wrk2 -c 8 -d 60s -t 8 -R 150 -L -s get_script.lua http://localhost:12345  
Running 1m test @ http://localhost:12345
  8 threads and 8 connections
  Thread calibration: mean lat.: 7.972ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 7.746ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.766ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 7.349ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.011ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.570ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 7.217ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 6.491ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.22ms    0.90ms  10.50ms   66.70%
    Req/Sec    19.21     28.62    76.00     68.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.16ms
 75.000%    7.84ms
 90.000%    8.43ms
 99.000%    9.49ms
 99.900%   10.12ms
 99.990%   10.34ms
 99.999%   10.50ms
100.000%   10.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.771     0.000000            1         1.00
       6.071     0.100000          755         1.11
       6.427     0.200000         1501         1.25
       6.699     0.300000         2254         1.43
       6.939     0.400000         3011         1.67
       7.163     0.500000         3751         2.00
       7.283     0.550000         4130         2.22
       7.407     0.600000         4501         2.50
       7.539     0.650000         4873         2.86
       7.683     0.700000         5259         3.33
       7.839     0.750000         5630         4.00
       7.927     0.775000         5812         4.44
       8.003     0.800000         6002         5.00
       8.099     0.825000         6190         5.71
       8.199     0.850000         6380         6.67
       8.319     0.875000         6578         8.00
       8.367     0.887500         6655         8.89
       8.431     0.900000         6749        10.00
       8.511     0.912500         6852        11.43
       8.583     0.925000         6939        13.33
       8.671     0.937500         7028        16.00
       8.719     0.943750         7080        17.78
       8.775     0.950000         7123        20.00
       8.855     0.956250         7170        22.86
       8.927     0.962500         7221        26.67
       9.007     0.968750         7263        32.00
       9.071     0.971875         7291        35.56
       9.111     0.975000         7313        40.00
       9.167     0.978125         7334        45.71
       9.247     0.981250         7359        53.33
       9.319     0.984375         7379        64.00
       9.359     0.985938         7391        71.11
       9.407     0.987500         7405        80.00
       9.447     0.989062         7416        91.43
       9.519     0.990625         7426       106.67
       9.591     0.992188         7439       128.00
       9.615     0.992969         7445       142.22
       9.639     0.993750         7450       160.00
       9.711     0.994531         7457       182.86
       9.743     0.995313         7461       213.33
       9.791     0.996094         7467       256.00
       9.831     0.996484         7471       284.44
       9.847     0.996875         7475       320.00
       9.879     0.997266         7476       365.71
       9.919     0.997656         7479       426.67
       9.951     0.998047         7482       512.00
       9.967     0.998242         7483       568.89
       9.991     0.998437         7485       640.00
      10.007     0.998633         7486       731.43
      10.095     0.998828         7488       853.33
      10.119     0.999023         7489      1024.00
      10.135     0.999121         7490      1137.78
      10.167     0.999219         7491      1280.00
      10.167     0.999316         7491      1462.86
      10.191     0.999414         7492      1706.67
      10.239     0.999512         7493      2048.00
      10.239     0.999561         7493      2275.56
      10.311     0.999609         7494      2560.00
      10.311     0.999658         7494      2925.71
      10.311     0.999707         7494      3413.33
      10.335     0.999756         7495      4096.00
      10.335     0.999780         7495      4551.11
      10.335     0.999805         7495      5120.00
      10.335     0.999829         7495      5851.43
      10.335     0.999854         7495      6826.67
      10.503     0.999878         7496      8192.00
      10.503     1.000000         7496          inf
#[Mean    =        7.222, StdDeviation   =        0.905]
#[Max     =       10.496, Total count    =         7496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9008 requests in 1.00m, 571.92KB read
Requests/sec:    150.11
Transfer/sec:      9.53KB